//6. Для цілочислової матриці знайти для кожного рядка кількість елементів, що кратні п’яти, і найбільший з одержаних результатів.
// 16. Знайти в кожному рядку перший з максимальних і перший з мінімальних елементів і поставити їх на першому (технічно 0-му) і останньому місцях рядка. Зверніть увагу, що випадки «перший є мінімальним» та/або «останній є єдиним максимальним» можуть створювати певні проблеми.
#include <iostream>

void task_one()
{
    
}

int main()
{

    int choice;
    std::cout << "Choose one of the tasks(1,2,3,4), or press 0, for leave:";
    std::cin >> choice;

    switch (choice)
    {
    case 1:
        std::cout << "you chose #1:\nДля цілочислової матриці знайти для кожного рядка кількість елементів, що кратні п’яти, і найбільший з одержаних результатів." << std::endl;
        break;
    case 2:
        break;
    
    case 3:

        break;
    case 4: 
        break;

    case 0:
        return 0;
    default:
        std::cout << "Invalid input, try again." << std::endl;
        break;
    }

    return 0;
}